### 6. Menggabungkan DataFrame
   * Ada 3 Cara untuk menggabungkan DataFrame
      1. Menggunakan fungsi Concat
      2. menggunakan fungsi Merge
      3. Menggunakan fungsi join

In [1]:
import pandas as pd

#### 1. Menggunakan Fungsi Concat
  Fungsi Concat digunakan untuk menggabungkan dua atau lebih DataFrame secara vertikal atau horizontal.
  * masukan kedalam list [] data yang ingin dimasukan nya
  * ada parameter axis denga nilai default 0, **kalo 1 akan merujuk penggabungan antar kolom nya**
  * .reset_index(drop=True) --> ini akan mereset index agar berurutan setelah penggabungan

In [2]:
# Membuat 3 DataFrame sebagai Data Awal
df1 = pd.DataFrame({
    'key' : ['A', 'B', 'C'],
    'value1' : [1, 2, 3]
})

df2 = pd.DataFrame({
    'key' : ['D', 'E', 'F'],
    'value1' : [4, 5, 6]
})

df3 = pd.DataFrame({
    'value' : [4, 5, 6]
})

In [3]:
df1

  key  value1
0   A       1
1   B       2
2   C       3

In [11]:
df2

  key  value1
0   D       4
1   E       5
2   F       6

In [12]:
df3

   value
0      4
1      5
2      6

In [13]:
# Menggabungkan 2 dataFrame df1 dan df2 (data memiliki kolom yang sama)
pd.concat([df1, df2]).reset_index(drop=True)

  key  value1
0   A       1
1   B       2
2   C       3
3   D       4
4   E       5
5   F       6

In [14]:
# Menggabungkan dataFrame ke df3, menempel ke df1
  #  axis=1 --> merujuk utk penggabungan kolom
pd.concat([df1, df3], axis=1)

  key  value1  value
0   A       1      4
1   B       2      5
2   C       3      6

#### Menggunakan Fungsi Merge dan Join
  Fungsi merge digunakan untuk menggabungkan dua DataFrame berdasarkan satu atau lebih kolom yang sama, Fungsi join digunakan untuk menggabungkan dua DataFrame **berdasarkan indeks**

In [16]:
# 4 DataFarame sebagai Data Awal
dfA = pd.DataFrame({
    'key' : ['A', 'B', 'C', 'D'],
    'value1' : [1,2,3,4]
})

dfB = pd.DataFrame({
    'key' : ['A', 'B', 'E', 'F'],
    'value1' : [5,6,7,8]
})

dfC = pd.DataFrame({
    'value1' : [1,2,3,4]
}, index=['A', 'B', 'C', 'D'])

dfD = pd.DataFrame({
    'value2' : [5,6,7,8]
}, index=['A', 'B', 'E', 'F'])

##### Fungsi merge
 akan menggabungkan data berdasarkan kata kunci yang sama
  * parameter on --> digunakan untuk mencari kata kunci yang sama
  * parameter how --> bagaimana kita ingin menggabungkan dataFrame ini, irisan nya
      * seperti di database apa 4
        1. Inner join -> kelaur hanya data yang sama
        2. Outer join -> semua data akan di keluarkan
        3. Left join -> akan mengeluarkan seluruh data sebelah kiri(dfA)
        4. Right join -> akan mengeluarkan seluruh data sebelah kanan(dfB)

In [17]:
#  kita menggunakan key yang sama
pd.merge(dfA, dfB, on='key', how='left')

  key  value1_x  value1_y
0   A         1       5.0
1   B         2       6.0
2   C         3       NaN
3   D         4       NaN

##### Fungsi join
  akan menggabungkan DataFrame berdasarkan indeks nya

  * parameter how --> bagaimana kita ingin menggabungkan dataFrame ini, irisan nya
      * seperti di database apa 4
        1. Inner join -> kelaur hanya data yang sama
        2. Outer join -> semua data akan di keluarkan
        3. Left join -> akan mengeluarkan seluruh data sebelah kiri(dfC)
        4. Right join -> akan mengeluarkan seluruh data sebelah kanan(dfD)

In [18]:
dfC.join(dfD, how='right')

   value1  value2
A     1.0       5
B     2.0       6
E     NaN       7
F     NaN       8